; English language file v3.4.2
; Author: bursoft
; In the codepage key must be specified code page number for this language (eg 1251 for the Russian, 1253 for the Greek, and so on).
codepage=1252
error=ERROR^!
startup_error1=Batch ApkTool do not have full access to the folder, or installation path contains invalid characters
startup_error2=Batch ApkTool do not have permissions to write to the folder
previous_java1=You have installed Java
previous_java2=Batch ApkTool works properly only with Java 7 or above
get_java=Get latest Java here https://www.java.com/en/download/
java_notfound=Java was not found
ON=YES
OFF=NO
MANUAL=MANUAL
project=Current project                             
currentapk=Selected APK                                
currentjar=Selected JAR                                
apilevel=API level                                 
keepbroken=keep broken resources                     
buildexpert=build in EXPERT mode                      
dontwritedebug=Don't write out debug info into smali       
signafter=Sign output APKs                            
key=key for signing                           
openlog=Open log                                    
language=Language                                    
deodexall=Deodex all APKs and JARs                    
copy_deodexed_apk=Copy deodexed APKs to _INPUT_APK            
copy_deodexed_jar=Copy deodexed JARs to _INPUT_JAR            
baksmaliapk=Decompile APKs (only smali)
smaliapk=Recompile APKs
baksmalijar=Decompile JARs (only smali)
smalijar=Recompile JARs
decompile=Decompile APKs                              
decompile_r=Decompile APKs (only resources)             
recompile=Recompile APKs                              
signfiles=Sign files
zipalfiles=Zipalign APKs
viewsource=View Java source code >
plugins=Plug-ins >
selplugin=SELECT PLUG-IN:
adbmenu=ADB:
devices=devices >                                   
install=install >                                   
rootremount=root, remount                               
pull=pull >                                      
push=push >                                      
screenshot=screenshot                                  
screenrecord=screenrecord
shell=shell
logs=logs >
reboot=reboot >
info=info
kill-server=kill-server
servicemenu=SERVICE:
cleanup1=Clean up _app, _priv-app, _framework        
cleanup2=Clean up _INPUT_APK, _INPUT_JAR             
cleanup3=Clean up _OUT_APK, _OUT_JAR  
cleanup4=Clean up ALL folders
exitmenu=EXIT
choosetask=PLEASE CHOOSE TASK:
instframe=Installing framework
instframe_error=Error installing framework
inputapk_empty=Put files for decompiling to _INPUT_APK folder. See readme.txt for details.
decompiling=Decompiling
decompiling_error=Error decompiling
recompiling=Recompiling
recompiling_error=Error recompiling
orignotfound=Error. Original file not found.
backupnotfound=Error. _backup folder not found.
done=DONE
signing=Signing
signing_error=Error signing
doneerrors=DONE with ^!count^! ERRORS.
zipal=Zipaligning
zipal_error=Error zipaligning
selectviewer=Select Java source code viewer:
cancel=CANCEL
makechoice=Please make your choice:
dragajd=drag APK, JAR or DEX file here:
genjava=Generating Java code from
genjava_error=Error generating Java code from
apilevel_log=API level                   
buildexpert_log=build in EXPERT mode        
signafter_log=Sign output APKs            
press1=Press ENTER to continue or input 1 to open log:
deletedialog=Delete all files in the following folders:
proceed=Proceed?
yes=YES
selproj=SELECT PROJECT:
createnewproj=Create new project
usedefproj=Use default project
inputprojname=Input project name:
selectapk=SELECT APK:
allapks=All APKs in _INPUT_APK
selectjar=SELECT JAR:
alljars=All JARs in _INPUT_JAR
selectapktool=SELECT APKTOOL:
selectsmali=SELECT SMALI:
aversions=Android version: 
apilevels=API level:      
enterapi=Enter API level:
invalidapi=Invalid API level^!
selectkey=SELECT KEY:
selectlang=SELECT LANGUAGE:
framework_empty=Put all framework files to _framework folder. See readme.txt for details.
deodexing=Deodexing
notodexed=File not odexed.
smerror=Error smaling
bsmerror=Error baksmaling
bootnotfound=boot.oat not found
selectarch=SELECT boot.oat ARCHITECTURE:
selectedarch=Architecture
extractboot=Extracting and deodexing boot.oat...
extractboot_error=Error extracting boot.oat
errorunp=Error unpacking
deodexing_error=Error deodexing
baksmaling=Baksmaling
smaling=Smaling
connection_type=Connection type:
input_ip=Input device IP, for example 192.168.1.3:
input_ip2=Input device IP or press ENTER to use the last IP
installtodef=Install to default memory:
singlefile=Single file
allfrom=All files from
installtosd=Install to SD:
dragtoinstall=Drag APK to install here:
installing=Installing
pull2=Pull:
pushto=Push to
dragtopush=Drag file to push here:
screensavedto=Screenshot saved to file
closetostop=Close this window to stop record
scrrecsavedto=Screen record saved to file
logcatr=radio
logcate=events
toscreen=show and save to file
tofile=Save to file
bugreport=Bugreport:
inlinetable=Inline method table:
saved_to_file=Log saved to file
android_version=Android Version:
brand=Brand:
model=Model:
reboot2=Reboot:
reboot3=Reboot
rebootto=Reboot to
symlinks=SYMLINKS
copied_files=Copied files: